IdeaRS.OpenModel.Result.LoadingType
Type of loading

IdeaRS.OpenModel.Result.LoadingType.LoadCase
Load case

IdeaRS.OpenModel.Result.LoadingType.Combination
Combination

IdeaRS.OpenModel.Result.LoadingType.ResultClass
Result Class